## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 0 to change, 10 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| recreate | `module.api_ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`         |
|          | `module.api_ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]`      |
|          | `module.api_ecs.aws_appautoscaling_target.this[0]`             |
|          | `module.api_ecs.aws_cloudwatch_log_group.this`                 |
|          | `module.api_ecs.aws_ecs_service.this`                          |
|          | `module.api_ecs.aws_ecs_task_definition.this`                  |
|          | `module.api_ecs.aws_iam_policy.this_task_exec`                 |
|          | `module.api_ecs.aws_iam_role.this_task`                        |
|          | `module.api_ecs.aws_iam_role.this_task_exec`                   |
|          | `module.api_ecs.aws_iam_role_policy_attachment.this_task_exec` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:UpdateItem",
                              + "dynamodb:Query",
                              + "dynamodb:PutItem",
                              + "dynamodb:GetItem",
                              + "dynamodb:BatchWriteItem",
                              + "dynamodb:BatchGetItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/index/*",
                              + "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault",
                            ]
                          + Sid      = "DynamoDBVault"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "kms:GenerateDataKey",
                              + "kms:Encrypt",
                              + "kms:Decrypt",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:kms:ca-central-1:687401027353:key/1f3edb85-9eac-4da9-8c7c-43a68e339ede"
                          + Sid      = "KMSVault"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:ListBucket",
                              + "s3:GetObjectVersionTagging",
                              + "s3:GetObjectVersion",
                              + "s3:GetObjectTagging",
                              + "s3:GetObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::forms-staging-vault-file-storage/*",
                              + "arn:aws:s3:::forms-staging-vault-file-storage",
                            ]
                          + Sid      = "S3Vault"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.api_ecs.aws_appautoscaling_policy.this["cpu"] must be replaced
-/+ resource "aws_appautoscaling_policy" "this" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/Forms/form-api-AlarmHigh-d5611394-11c6-447d-aa4d-f240a5fcbfa1",
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/Forms/form-api-AlarmLow-2168351e-65c3-4004-8290-c93317e75bab",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:687401027353:scalingPolicy:0adf03f9-dd50-4df2-80e5-4a9ae8b43ece:resource/ecs/service/Forms/form-api:policyName/cpu" -> (known after apply)
      ~ id                 = "cpu" -> (known after apply)
        name               = "cpu"
      ~ resource_id        = "service/Forms/form-api" -> "service/Forms/forms-api" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api_ecs.aws_appautoscaling_policy.this["memory"] must be replaced
-/+ resource "aws_appautoscaling_policy" "this" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/Forms/form-api-AlarmHigh-5e75086c-0b39-4b24-9f7d-ef94553fb810",
          - "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TargetTracking-service/Forms/form-api-AlarmLow-591e0657-3ecc-4fcf-95ad-8005c26abc1c",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:687401027353:scalingPolicy:0adf03f9-dd50-4df2-80e5-4a9ae8b43ece:resource/ecs/service/Forms/form-api:policyName/memory" -> (known after apply)
      ~ id                 = "memory" -> (known after apply)
        name               = "memory"
      ~ resource_id        = "service/Forms/form-api" -> "service/Forms/forms-api" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api_ecs.aws_appautoscaling_target.this[0] must be replaced
-/+ resource "aws_appautoscaling_target" "this" {
      ~ arn                = "arn:aws:application-autoscaling:ca-central-1:687401027353:scalable-target/0ec50adf03f9dd504df280e54a9ae8b43ece" -> (known after apply)
      ~ id                 = "service/Forms/form-api" -> (known after apply)
      ~ resource_id        = "service/Forms/form-api" -> "service/Forms/forms-api" # forces replacement
      ~ role_arn           = "arn:aws:iam::687401027353:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
        tags               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.api_ecs.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/ecs/Forms/form-api" -> (known after apply)
      ~ id                = "/aws/ecs/Forms/form-api" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/ecs/Forms/form-api" -> "/aws/ecs/Forms/forms-api" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api_ecs.aws_ecs_service.this must be replaced
-/+ resource "aws_ecs_service" "this" {
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/Forms/form-api" -> (known after apply)
      ~ name                               = "form-api" -> "forms-api" # forces replacement
        tags                               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:687401027353:task-definition/form-api:5" -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (13 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - load_balancer {
          - container_name   = "form-api" -> null
          - container_port   = 3001 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "forms-api"
          + container_port   = 3001
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.api_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/form-api:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:687401027353:task-definition/form-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ Environment            = [] -> null
                  ~ LogConfiguration       = {
                      ~ Options       = {
                          ~ awslogs-group         = "/aws/ecs/Forms/form-api" -> "/aws/ecs/Forms/forms-api"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    }
                  ~ Name                   = "form-api" -> "forms-api"
                    # (37 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ execution_role_arn       = "arn:aws:iam::687401027353:role/form-api_ecs_task_exec_role" # forces replacement -> (known after apply) # forces replacement
      ~ family                   = "form-api" -> "forms-api" # forces replacement
      ~ id                       = "form-api" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ task_role_arn            = "arn:aws:iam::687401027353:role/form-api_ecs_task_role" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api_ecs.aws_iam_policy.this_task_exec must be replaced
-/+ resource "aws_iam_policy" "this_task_exec" {
      ~ arn              = "arn:aws:iam::687401027353:policy/form-api_ecs_task_exec_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::687401027353:policy/form-api_ecs_task_exec_policy" -> (known after apply)
      ~ name             = "form-api_ecs_task_exec_policy" -> "forms-api_ecs_task_exec_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/ecs/Forms/form-api:*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault/index/*",
                          - "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault",
                        ]
                      - Sid      = "DynamoDBVault"
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:687401027353:key/1f3edb85-9eac-4da9-8c7c-43a68e339ede"
                      - Sid      = "KMSVault"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::forms-staging-vault-file-storage/*",
                          - "arn:aws:s3:::forms-staging-vault-file-storage",
                        ]
                      - Sid      = "S3Vault"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPA2ADCLI4MZDGKQTYDT" -> (known after apply)
        tags             = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.api_ecs.aws_iam_role.this_task must be replaced
-/+ resource "aws_iam_role" "this_task" {
      ~ arn                   = "arn:aws:iam::687401027353:role/form-api_ecs_task_role" -> (known after apply)
      ~ create_date           = "2024-07-26T12:56:29Z" -> (known after apply)
      ~ id                    = "form-api_ecs_task_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "form-api_ecs_task_role" -> "forms-api_ecs_task_role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ unique_id             = "AROA2ADCLI4MSPM7LPDOF" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.api_ecs.aws_iam_role.this_task_exec must be replaced
-/+ resource "aws_iam_role" "this_task_exec" {
      ~ arn                   = "arn:aws:iam::687401027353:role/form-api_ecs_task_exec_role" -> (known after apply)
      ~ create_date           = "2024-07-26T12:56:30Z" -> (known after apply)
      ~ id                    = "form-api_ecs_task_exec_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::687401027353:policy/form-api_ecs_task_exec_policy",
        ] -> (known after apply)
      ~ name                  = "form-api_ecs_task_exec_role" -> "forms-api_ecs_task_exec_role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ unique_id             = "AROA2ADCLI4M7AIUEQ7JS" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.api_ecs.aws_iam_role_policy_attachment.this_task_exec must be replaced
-/+ resource "aws_iam_role_policy_attachment" "this_task_exec" {
      ~ id         = "form-api_ecs_task_exec_role-20240726125630390700000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::687401027353:policy/form-api_ecs_task_exec_policy" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "form-api_ecs_task_exec_role" -> "forms-api_ecs_task_exec_role" # forces replacement
    }

Plan: 10 to add, 0 to change, 10 to destroy.

Changes to Outputs:
  ~ ecs_api_cloudwatch_log_group_name = "/aws/ecs/Forms/form-api" -> "/aws/ecs/Forms/forms-api"
  ~ ecs_api_service_name              = "form-api" -> "forms-api"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
